tutorials/simpleFoam/pitzDaily3Blocks/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner
        {
            type        DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-06;
        relTol           0.01;
    };
    U PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    k PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    epsilon PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    R PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
    nuTilda PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-05;
        relTol           0.1;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    k               0.7;
    epsilon         0.7;
    R               0.7;
    nuTilda         0.7;
}


// ************************************************************************* //
